
def classes_choose(number):
    if number == 1:    
        pupil_11 = {
            'Егоров' : {
                'Алгебра': [5, 5, 5, 5, 5],
                'Русский язык': [5, 5, 4, 3, 5], 
                'Обществознание': [4, 5, 5, 5, 4]
            }, 
            'Окунев' : {
                'Алгебра': [5, 3, 5, 3, 5],
                'Русский язык': [5, 5, 4, 3, 5], 
                'Обществознание': [2, 5, 2, 5, 2]
            },
            'Исаев' : {
                'Алгебра': [2, 3, 4, 5, 2], 
                'Русский язык': [5, 4, 3, 3, 2], 
                'Обществознание': [4, 5, 4, 5, 4]
            },
        }
    if number == 2:
            pupil_11 = {
                'Солодовников' : {
                    'Алгебра': [5, 5, 5, 5, 5],
                    'Русский язык': [5, 5, 4, 3, 5], 
                    'Обществознание': [4, 5, 5, 5, 4]
                }, 
                'Игнатов' : {
                    'Алгебра': [5, 3, 5, 3, 5],
                    'Русский язык': [5, 5, 4, 3, 5], 
                    'Обществознание': [2, 5, 2, 5, 2]
                },
                'Фурсов' : {
                    'Алгебра': [2, 3, 4, 5, 2], 
                    'Русский язык': [5, 4, 3, 3, 2], 
                    'Обществознание': [4, 5, 4, 5, 4]
                },
        }
    return pupil_11
